Kemerd/ADSBin/sdkconfig.defaults
# ============================================================================
#  ADSBin - default sdkconfig (seeds a fresh build; the real sdkconfig is
#  generated and git-ignored). Phase 0 scaffold scope: target, console, dual
#  core, custom partitions. USB-host tuning lands in Phase 1; WiFi/C6 Phase 10.
# ============================================================================

# --- Target -----------------------------------------------------------------
# ESP32-P4: dual-core RISC-V, USB 2.0 High-Speed OTG host. The HS host is the
# whole reason for this part - 2.4 Msps x 2 bytes ~= 4.8 MB/s of IQ is far past
# what a Full-Speed S3 could carry (IMPLEMENTATION_PLAN.md S5.1).
CONFIG_IDF_TARGET="esp32p4"

# --- Silicon revision -------------------------------------------------------
# Our physical dev board carries an EARLY P4 sample (rev v1.3). ESP-IDF v6
# defaults the P4 to the mass-production v3.x family, but rev <3.0 and >=3.0 are
# a "mutually exclusive" hardware split (see esp_hw_support P4 Kconfig): a v3.x
# image refuses to boot/flash on v1.x silicon. Opt into the pre-v3 family and
# set the minimum supported revision to v1.0 so this v1.3 chip is in range.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --- Console / logging ------------------------------------------------------
# The P4's USB-C port is power + debug, carrying console/monitor AND the MVP
# GDL90 / sink_debug stream (S1.1, S4.5). The transport chip depends on the
# board, though: THIS dev board routes its single USB-C jack through an on-board
# CH343 USB-UART bridge wired to the P4's default download UART (UART0) — the
# native USB-Serial/JTAG controller has no connector. So the console must be on
# UART0, not USB-Serial/JTAG, or nothing reaches the host (and the bench can't
# feed packets in). UART0's pre-defined GPIOs are the same pins esptool flashes
# over, which is why flashing works on this board. Boards that break out the
# native USB-C port can switch this back to CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- FreeRTOS / SMP ---------------------------------------------------------
# Keep BOTH cores online. Core 0 is the hard-real-time RX+DSP path, Core 1 is
# decode + serve (S2). Never enable UNICORE. 1 kHz tick gives 1 ms aging math.
# CONFIG_FREERTOS_UNICORE is not set
CONFIG_FREERTOS_HZ=1000

# --- Flash / partitions -----------------------------------------------------
# 16 MB assumed (typical P4 dev board). If your board differs, change this one
# line; the partition layout fits in 8 MB too. Two OTA app slots leave room for
# field firmware updates without a serial cable later.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Logging verbosity (bring-up) ------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
